000_РОЗНИЦА_ЦЕНТР/src/Documents/РеестрЭН/РеестрЭН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрЭН</name>
  <posting>Deny</posting>
  <attributes>
    <name>Напечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МагазинСклад</name>
    <type>
      <types>CatalogRef.Магазины</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЭН</name>
    <attributes>
      <name>ЭлектронныеНакладные</name>
      <type>
        <types>DocumentRef.ЭлектроннаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЭлектроннаяНакладная/ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектроннаяНакладная</name>
  <basedOn>Document.ЗапросДоступностиТоваров</basedOn>
  <attributes>
    <name>АдресОтправитель</name>
    <type>
      <types>CatalogRef.АдресаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>CatalogRef.АдресаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратОтКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправитель</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПолучатель</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектроннаяНакладная</types>
      <types>DocumentRef.ВозвратИнтернетЗаказа</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДомПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаНаАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвартираОтправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвартираПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоОтправитель</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентОтправитель</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Локал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НашаСуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДомаОтправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаОтправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтделениеОтправитель</name>
    <type>
      <types>CatalogRef.Отделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтделениеПолучатель</name>
    <type>
      <types>CatalogRef.Почтоматы</types>
      <types>String</types>
      <types>CatalogRef.Отделения</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаИзМагазина</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресацияНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикСлужбойДоставки</name>
    <type>
      <types>CatalogRef.ПоставщикиСлужбойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСтикера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуТТННакладная</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрЭН</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПосылокСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороннийОтправитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныеДокументыОтправлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УлицаОтправитель</name>
    <type>
      <types>CatalogRef.Улицы</types>
    </type>
  </attributes>
  <attributes>
    <name>УлицаПолучатель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Улицы</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияПолучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтажОтправителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтажПолучателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Ширина</name>
      <comment>Ширина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>Высота в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Глубина</name>
      <comment>Глубина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, кг</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РеестрЭН/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭН


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереносВДругойРеестр(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы хотите перенести эти накладные в другой реестр?'"), Режим, 0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
   
    Если Результат = КодВозвратаДиалога.Да Тогда
    	МассивДокументов = Новый Массив();
    	Для Каждого ТекущаяВыделеннаяСтрока Из Элементы.СписокЭН.ВыделенныеСтроки Цикл
    		ВыделеннаяСтрока = Объект.СписокЭН.НайтиПоИдентификатору(ТекущаяВыделеннаяСтрока);
    		МассивДокументов.Добавить(ВыделеннаяСтрока.ЭлектронныеНакладные);
    	КонецЦикла;

   		ПеренестиВРеестр(МассивДокументов, Объект.Ссылка);
   		
   		ОбновитьОтображениеДанных();
		Прочитать();

    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПеренестиВРеестр(МассивДокументовРеестра, ТекущийРеестр)

	РеестрДляЗаписи = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрЭН.Ссылка,
		|	РеестрЭН.ВнешняяСсылка
		|ИЗ
		|	Документ.РеестрЭН КАК РеестрЭН
		|ГДЕ
		|	НЕ РеестрЭН.Напечатан
		|	И НЕ РеестрЭН.Ссылка = &Ссылка
		|	И РеестрЭН.МагазинСклад = &МагазинСклад";
		
	Запрос.УстановитьПараметр("Ссылка", ТекущийРеестр);
	Запрос.УстановитьПараметр("МагазинСклад", ТекущийРеестр.МагазинСклад);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РеестрДляЗаписи = Выборка.ВнешняяСсылка;
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектроннаяНакладная.Ссылка,
		|	ЭлектроннаяНакладная.ВнешняяСсылка
		|ИЗ
		|	Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|ГДЕ
		|	ЭлектроннаяНакладная.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивДокументовРеестра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбменНПСервер.УдалитьИзРеестра(Выборка.Ссылка, Выборка.ВнешняяСсылка);
		ОбменНПСервер.ДобавитьВРеестрЕН(Выборка.Ссылка, Выборка.ВнешняяСсылка, РеестрДляЗаписи);
		ДокументЭН = Выборка.Ссылка.ПолучитьОбъект();
		ДокументЭН.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
